app/views/homepage/index.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."blogpost_id" = 17
---
                                <% end %>
                                <a href='#' data-toggle="modal" data-target="#commentModal<%= n %>">Comment</a>  <a href='#' data-toggle="modal" data-target="#listcommentModal<%= n %>"><span class="badge"> <%= Comment.where(blogpost_id: blogpost.id).count %></span></a> | <%=blogpost.created_at%>