app/controllers/blogposts_controller.rb

  def index
    @blogposts = Blogpost.all
---
SELECT "blogposts".* FROM "blogposts"

  def create
    @blogpost = Blogpost.new(blogpost_params)

    respond_to do |format|
      if @blogpost.save
---
INSERT INTO "blogposts" ("content", "created_at", "image", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "<p>asdsad</p>\r\n"], ["created_at", "2014-08-12 03:32:02.768156"], ["image", "oliver.jpg"], ["title", "asdasd"], ["updated_at", "2014-08-12 03:32:02.768156"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @blogpost.update(blogpost_params)
---
UPDATE "blogposts" SET "title" = ?, "updated_at" = ? WHERE "blogposts"."id" = 2  [["title", "Lame Post2"], ["updated_at", "2014-08-11 19:56:21.807761"]]

  def destroy
    @comments = Comment.where(blogpost_id: @blogpost.id)
    @comments.each do |comment|
      comment.destroy
    end

    @blogpost.destroy
---
SELECT "comments".* FROM "comments"  WHERE "comments"."blogpost_id" = 17
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 20]]
DELETE FROM "blogposts" WHERE "blogposts"."id" = ?  [["id", 1]]

    def set_blogpost
      @blogpost = Blogpost.find(params[:id])
---
SELECT  "blogposts".* FROM "blogposts"  WHERE "blogposts"."id" = ? LIMIT 1  [["id", 1]]