app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("blogpost_id", "content", "created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["blogpost_id", 1], ["content", "Wow Insightful!!!"], ["created_at", "2014-08-11 18:55:37.551040"], ["name", " "], ["updated_at", "2014-08-11 18:55:37.551040"], ["user_id", 1]]