app/controllers/homepage_controller.rb

  def index
    @blogposts = Blogpost.order('created_at DESC').paginate(:page => params[:page], :per_page => 3)
    @comments = Comment.all
---
SELECT  "blogposts".* FROM "blogposts"   ORDER BY created_at DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "blogposts"
SELECT "comments".* FROM "comments"